# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример: 45 -> 101101; 3 -> 11.

x = int(input("Введите число:  "))
print(bin(x)[2:])

